<?php
$this->title = 'Английский язык по методу Умина / Замяткина. Бесплатное обучение';
$this->params['keywords'] = 'английский язык, обучение, бесплатно, Умин, Замяткин, лингафон, аудирование';
$this->params['description'] = 'Оригинальная методика изучения английского языка по методу Умина / Замякина. Тут Вы 
    сможете приобрести хороший словарный запас, научиться читать по-английски, понимать письменную и устную английскую 
    речь, а также говорить с правильным произношением.';
?>
<style>
    p {
        font-size: 20px;
    }

    div.lesson {
        border: 1px solid black;
        width: 300px;
        padding: 10px;
        margin: 10px;
        border-radius: 5px;
    }
</style>

<H1>Лингафонные курсы английского лингафонного института.</H1>
<p>Оригинальная методика изучения английского языка Умина / Замяткина. Данная методика позволяет одновременно
    увеличивать словарный запас, учиться разговаривать на английском языке, понимать устную и письменную речь. За
    короткий промежуток времени Вы получите необходимы навыки для общения на английском языке. Подробное описание курса
    <a href="/lingofon/metod_umin_zamyatkin" target="_blank">можно&nbsp;прочитать&nbsp;тут&nbsp;»»»</a></p>
<div style='display: flex; flex-wrap: wrap;'>
    <div class="lesson">
        <H3><a href="/course/linguaphone_institute_english_course_for_beginners">
                Лингафонный курс уровня: beginner.</a></H3>

        <p>Лингафонный курс уровня beginner рассчитан на людей уже владеющих английским языком на начальном уровне. Если
            первый урок курса вызовет у вас затруднения, начните с курса <a href="/skulte_anglijskij_dlya_detej">Валентины
                Скультэ »»»</a></p>
        <p><a href="/course/linguaphone_institute_english_course_for_beginners"
            >Перейти к списку уроков</a></p>
    </div>
    <div class="lesson">
        <H3><a href="/course/linguaphone_institute_english_course_for_intermediate" target="_blank">
                Лингафонный курс уровня: Intermediate.</a></H3>

        <p>Intermediate — это «средний» уровень владения языком,
            на котором Вы достаточно свободно разговариваете на английском, можете обсуждать многие профессиональные и
            бытовые темы, понимаете на слух практически всё сказанное на английском языке в обычном темпе.
        </p>
        <p><a href="/course/linguaphone_institute_english_course_for_intermediate"
            >Перейти к списку уроков</a></p>
    </div>
</div>
