<?php
$this->title = 'Английский язык для детей по учебнику Валентины Скультэ. Первый и второй тома.';
$this->params['keywords'] = 'английский язык, обучение, бесплатно, Валенина Скультэ, английский для детей';
$this->params['description'] = 'На сайте размещены он-лайн курсы английского языка. Курс Валетины Скультэ Английский 
    язык для детей. Курс позволяет изучить английский язык от полного незнания до уверенного пользования.';
?>
<style>
    p {
        font-size: 20px;
    }

    div.lesson {
        border: 1px solid black;
        width: 300px;
        padding: 10px;
        margin: 10px;
        border-radius: 5px;
    }
</style>

<H1>Учебник Валентины Скультэ Английский для детей в двух томах.</H1>
<p>Замечательный учебник Валентины Скультэ помог миллионам советских и российских детей и взрослых овладеть английским
    языком. Курс на основе этого учебника проведёт Вас от полного незнания английского языка до уверенного умения
    понимать, правильно разговаривать и читать на английском языке. Первый том – познакомит Вас с азами
    английского языка. Второй том, выведет Вас на уровень уверенного общения на языке. </p>
<div style='display: flex; flex-wrap: wrap;'>
    <div class="lesson">
        <H3><a href="/course/valentina_skulte_anglijskij_dlya_detej_tom_1">
                Валентина Скультэ. Английский язык для детей. Том 1.</a></H3>

        <p>Первый том курса рассчитан на людей совсем не знакомых с английским языком или на людей, которые начинали
            заниматься, но бросили. Начав заниматься по этому учебнику, Вы увидите, что английский это просто и быстро.
            Уже через неделю занятий Вы почувствуете результат.</p>
        <p><a href="/course/valentina_skulte_anglijskij_dlya_detej_tom_1"
            >Перейти к списку уроков</a></p>
    </div>
    <div class="lesson">
        <H3><a href="/course/valentina_skulte_anglijskij_dlya_detej_tom_2" target="_blank">
                Валентина Скультэ. Английский язык для детей. Том 2.</a></H3>

        <p>Второй том рассчитан на тех, кто уже знаком с английским языком на уровне ‘Настоящего неопределённого
            времени’. Попробуйте первый урок и если он покажется Вам трудным, начните с первого тома.</p>
        <p><a href="/course/valentina_skulte_anglijskij_dlya_detej_tom_2"
            >Перейти к списку уроков</a></p>
    </div>
</div>
