<?php
$this->title = "Описание программы проигрывания лингафонных аудированных уроков английского языка. Программа помогает интенсивно изучать английский язык.";
$this->params['keywords'] = "английский язык, обучение, бесплатно, лингафон, аудирование, быстрое изучение английского языка";
$this->params['description'] = "Описание программы проигрывания лингафонных аудированных уроков английского языка. Система основана на методиках, которые позволяют быстро овладеть устной английской речью. Выработать правильное произношение и навыки устной английской речи.";
?>
<style>
    p {
        font-size: 20px;
    }
</style>
<h1>Аудирование лингафонного урока английского языка</h1>
<h2>Страница помощи</h2>
<br>
<p>Так выглядит страница с проигрывателем аудированного лингафонного урока:</p>
<img src="/img/player_of_the_audited_lesson_1.jpg"
     style="display: block; border-radius: 5px; border: 3px dashed lightgray; padding: 5px">
<br>
<p>Что бы начать воспроизведение нужно нажать на кнопку "<b>Play</b>". Надпись на кнопке изменится на "<b>Stop</b>" и
    начнется воспроизведение урока. Что бы остановить воспроизведение нажмите на кнопку "<b>Stop</b>"</p>
<p>По умолчанию скорость воспроизведения снижена до 60%. Если Вы захотите изменить скорость воспроизведения, нажмите на
    цифру рядом с надписью: "<b>Темп речи</b>".</p>
<p>По умолчанию урок воспроизводится по одному предложению. И каждое предложение автоматически повторяется. Чтобы
    перейти к следующему предложению нажмите на кнопку "<b>Далее >>></b>" если хотите вернуться к предыдущему на кнопку
    "<b><<<</b>"</p>
<p>Если хотите, чтобы урок проигрывался не по одному предложению, а сразу весь, нажмите на кнопку "<b>Проигрывать&nbsp;всё</b>".
    Надпись на кнопке изменится на "<b>По одному</b>". Если Вы захотите снова слушать урок по одному предложению,
    нажмите на кнопку "<b>По одному</b>"</p>
<p>Если Вы захотите выключить повторение нажмите на кнопку "<b>Без&nbsp;повтора</b>". Надпись на кнопке изменится на
    "<b>Повторять</b>". Что бы снова включить повторение нажмите на кнопку "<b>Повторять</b>"</p>
<p>Если Вы хотите увидеть текст предложения, которое воспроизводится в данный момент нажмите на кнопку "<b>Текст +</b>".
    Надпись на кнопке изменится на "<b>Текст -</b>" и на экране появится текст предложения.</p>
<img src="/img/player_of_the_audited_lesson_2.jpg"
     style="display: block; border-radius: 5px; border: 3px dashed lightgray; padding: 5px">
<p>Что бы убрать текст с экрана нажмите на кнопку "<b>Текст -</b>"</p>
<p>Если Вы хотите увидеть перевод предложения, которое воспроизводится в данный момент нажмите на кнопку "<b>Перевод
        +</b>". Надпись на кнопке изменится на "<b>Перевод -</b>" и на экране появится перевод предложения.</p>
<img src="/img/player_of_the_audited_lesson_3.jpg"
     style="display: block; border-radius: 5px; border: 3px dashed lightgray; padding: 5px">
<p>Что бы убрать перевод с экрана нажмите на кнопку "<b>Перевод -</b>"</p>
<p>При помощи кнопок "<b>Шрифт +</b>" и "<b>Шрифт -</b>" Вы можете увеличить или уменьшить размер шрифта, которым
    печатается текст и перевод.</p>
<p><b>Дополнительные удобства</b>: При клике (одинарном прикосновении) к тексту Вы переключите урок к следующей записи.
    При двойном клике (двойном прикосновении) к тексту Вы включите / выключите воспроизведение текущей записи.</p>
