<?php
$this->title = "Описание программы проигрывания уроков разговорной практики английского языка. Программа помогает интенсивно изучать английский язык.";
$this->params['keywords'] = "английский язык, обучение, бесплатно, лингафон, разговорная практика, быстрое изучение английского языка";
$this->params['description'] = "Описание программы уроков разговорной практики английского языка. Система основана на методиках, которые позволяют быстро овладеть устной английской речью. Выработать правильное произношение и навыки устной английской речи.";
?>
<style>
    p {
        font-size: 20px;
    }
</style>
<h1>Разговорная практика</h1>
<h2>Страница помощи</h2>
<br>
<p>Так выглядит страница урока разговорной практики:</p>
<img src="/img/player_of_the_speaking_1.jpg"
     style="display: block; border-radius: 5px; border: 3px dashed lightgray; padding: 5px">
<br>
<p>На экране Вы виде фразу которую нужно произнести по-английски</p>
<p>Что бы проверить правильно ли Вы произнесли фразу нажмите на кнопку "<b>Play</b>".</p>
<p>Сайт произнесет и покажет на экране правильный ответ.</p>
<img src="/img/player_of_the_speaking_2.jpg"
     style="display: block; border-radius: 5px; border: 3px dashed lightgray; padding: 5px">
<br>
<p>Что бы перейти к следующей фразе, нажмите на кнопку "<b>Далее</b>".</p>
<p>Что бы вернуться к предыдущей, нажмите на кнопку "<b><<<</b>".</p>