<?php
$this->title = "Описание курса английского языка по лингафонному курсу Умина / Замяткина.";
$this->params['keywords'] = "английский язык, обучение, бесплатно, метод Умина, Умин, Замяткин, метод Замяткина";
$this->params['description'] = "Описание курса английского языка по лингафонному курсу Умина / Замяткина. Методика позволяет быстро научиться понимать английскую речь на слух. Выработать правильное произношение. И развить навыки правильной речи на английском языке. Освоить английский разговорный язык. Курс полностью бесплатный.";
?>

<style>
    p {
        font-size: 20pt;
    }
</style>

<h1>Описание курса изучения английского языка по лингафонному курсу Умина / Замяткина.</h1>

<p>
    Изучение английского языка можно разделить на 4 большие части:
<p>
    <b>1.</b> Понимание устной разговорной речи на английском языке.<br>
    <b>2.</b> Понимание письменной английской речи.<br>
    <b>3.</b> Умение разговаривать на английском языке (в том числе правильное произношение).<br>
    <b>4.</b> Умение писать на английском языке.<br></p>
<p>
    Традиционные методы и программы по изучению английского языка разделяют все эти 4 части изучения языка на отдельные
    блоки и программы. И сводят всё обучение к нудному заучиванию английских слов и изучению грамматики. Тем самым
    растягивая обучение на неопределенный срок с неопределенными результатами.</p>
<p>
    Изучение английского языка по лингафонному курсу методом Умина / Замяткина позволяет вам с первого занятия учиться
    понимать английскую речь, правильно произносить связанные предложения на английском языке, а также читать на
    английском языке.</p>
<p>
    Этот курс английского языка не требует от Вас занятий с преподавателем, хождения на курсы, приобретения учебных
    материалов или каких-либо иных трат. Вам достаточно иметь телефон, наушники и желание изучить английский язык.</p>
<p>
    Вам даже не обязательно выбирать отдельное время для занятий. Можно учить английский язык по дороге на работу или с
    работы, занимаясь спортом или просто гуляя.</p>
<p>
    Теперь непосредственно о том, как учить английский язык по лингафонному курсу методом Умина / Замяткина.
</p>
<h2>Английский язык по лингафонному курсу методом Умина / Замяткина.</h2>
<p>
    На сайте размещены лингафонные курсы английского языка. Лингафонный курс — это мини история или диалог начитанный
    носителем английского языка. Профессиональным актером или диктором английского телевидения и радио. Все лингафонные
    курсы разбиты на малые части чтобы упростить их восприятие и изучение. Вы будете усваивать английскую речь малыми
    частями, по одному предложению.</p>
<p>
    Обучение состоит из 4-х простых шагов:</p>
<p>
    <b>1.</b> Прослушивание предложения из лингафонного урока. В ходе прослушивания Вы стараетесь услышать и отделить
    все услышанные слова друг от друга. На этом этапе смысл и перевод услышанного Вам понимать необязательно. Нужно
    только различить максимально большое количество слов в предложении. Научить ухо слышать английскую речь. Слушать
    предложение нужно до тех пор, пока Вы не различите все слова в предложении или пока новые прослушивания не
    перестанут улучшать Ваше восприятие.</p>
<p>
    <b>2.</b> Продолжая слушать английский текст начните смотреть на напечатанную версию того что в данный момент
    слушаете (распечатки всех лингафонных курсов на сайте есть и доступны на странице урока). Рассматривая текст Вы
    увидите правильно ли Вы на слух различили слова в предложении. На этом этапе Вы научитесь правильно читать
    английские слова и воспринимать на слух непривычные звуки английской речи. Продолжайте слушать предложение пока не
    начнете четко слышать все слова, произносимые в предложении.</p>
<p>
    <b>3.</b> На этом этапе Вы открываете перевод английского текста (все переводы есть на сайте и доступны на странице
    урока) и внимательно смотрите как переводится текст. С открытым переводом прослушиваете текст несколько раз так,
    чтобы английский текст и перевод на русский язык у вас твердо связались.</p>
<p>
    <b>4.</b> Наконец произношение. После того как перевод английского текста Вам стал понятен Вы убираете с экрана
    русский текст и оставляйте только английский. Одновременно слушая и прослеживая текст глазами начинайте про себя, в
    голове, не шевеля губами проговаривать текст вслед за диктором. Как только Вам это удастся, начните проговаривать
    этот текст тихим шепотом двигая губами. Как только Вам это удастся, начните проговаривать текст вслух. Чем громче
    Вы это сделаете, тем лучше. Проговаривая старайтесь чтобы Ваша интонация и произношение были максимально похожи на
    речь английского диктора. Также желательно добиться и скорости произношения как у диктора. Как только это у Вас
    получится, остановите проигрывание предложения (текст предложения оставьте на экране) и начните читать текст вслух.
    Прочитайте текст 3 - 4 раза. Снова включите проигрывание и проверьте Ваше произношение. И наконец, последнее,
    выключите звук, уберите с экрана текст и попробуйте самостоятельно, осмысленно, понимая перевод произносить
    английскую фразу. Осознавая, что Вы говорите. Закончите это упражнение, как только начнете говорить фразу без
    затруднений и запинки.</p>
<p>
    Итак, переходя от предложения к предложению пройдите весь урок. Как только Вы изучите все предложения по
    отдельности, включите воспроизведение урока целиком, а не по 1 предложению. Как только Вы начнете понимать урок в
    такой форме, можно переходить к следующему уроку.</p>
</p>
<br>
<h3>Продолжительность занятий.</h3>
<p>
    Лингафонный курс разбит на уроки продолжительностью от 20 секунд до полутора минут. На каждом занятии Вам нужно
    брать уроки, суммарная длительность которых не более полутора минут. Тогда Вы сможете освоить материал примерно за
    час.</p>
<p>
    Замечание: не следует пренебрегать пунктом 4. Проще сразу сформировать правильное произношение чем потом исправлять
    неверное. Это точно без преподавателя не получится.</p>
<p>
    Примерно через 3 месяца таких занятий Вы сможете свободно понимать английскую речь и уверенно объясняться на
    английском языке.</p>
<p>
    <b>PS</b> перед каждым новым занятием, не забывайте повторять ранее пройденные уроки. Очень помогает.</p>
<p>
    <a href="/lingofon/help_lingofon_lesson_player" title="Страница помощи по использованию проигрывателя аудированного урока английского языка">Как пользоваться проигрывателем аудио урока?</a></p>
<p>
    <a href="/lingofon/lesson_list?lingofon_id=1" title="Лингафонный курс по методу Умина / Замяткина">Перейти к
        лингафонному курсу&nbsp;>>></a></p>