<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Как проходить данный курс.",
        ],
        [
            "type" => "content",
            "content" => "Как проходить уроки курса описано в первом томе учебника. Что бы прочитать об этом перейдите 
                по ссылке: <a target='_blank' href='/skulte_anglijskij_dlya_detej/first_volume/lessons/first_english_lesson'>как учиться по учебнику Валентины Скультэ Английский для детей.</a>",
        ],
        [
            "type" => "header",
            "content" => "Особенности второго тома.",
        ],
        [
            "type" => "content",
            "content" => "Во втором томе размер уроков больше чем в первом. Поэтому можно разбить урок на части и 
                осваивать материал в течении 2-х — 3-х дней. В первой части брать новые слова и теорию, а во 
                второй аудио материалы и речевую практику. Если такое деление покажется Вам недостаточным, 
                разделите урок на более мелкие части.",
        ],
        [
            "type" => "content",
            "content" => "<b>Важные замечания:</b><br>
                            1. Начинать урок лучше с изучения новых слов.<br>
                            2. Уроки второго раздела перегружены теорией (грамматикой). Пусть Вас это не пугает. Теорию 
                            не нужно зубрить. Просто пробегите её глазами и переходите к аудио уроку. К теории 
                            обращайтесь только если не поймете, как построено то или иное предложение.<br>
                            3. Речевую практику можно отложить до момента когда Вы начнете уверенно понимать английскую 
                            речь в лингафонных уроках. Не нужно себя перегружать.",
        ],
    ],
];


// «»
// <u></u>
// <b class='color'></b>

