<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Герундий в английском языке.",
        ],
        [
            "type" => "content",
            "content" => "В английском языке существует особая форма глагола, которая называется герундий (Gerund). 
                Герундий переводится на русский язык или неопределённой формой глагола, или отглагольным существительным.",
        ],
        [
            "type" => "content",
            "content" => "Образуется герундий из неопределённой формы глагола без частицы «to» + окончание «-ing».",
        ],
        [
            "type" => "example",
            "content" => [
                ["read / reading", "читать / чтение"],
                ["jump / jumping", "прыгать / прыганье"],
            ],
        ],
        [
            "type" => "content",
            "content" => "После определённых глаголов в качестве прямого дополнения может стоять только герундий, а не 
                неопределённая форма глагола. Вот некоторые их этих глаголов:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["avoid","избегать", ""],
                ["finish","кончать", ""],
                ["go on","продолжать", ""],
                ["give up","прекращать", ""],
                ["stop","прекращать", ""],
                ["excuse","извинять", ""],
                ["mind","возражать", ""],
            ],
        ],
        [
            "type" => "example",
            "content" => [
                ["Avoid using that word.","Избегай употреблять это слово.", ""],
                ["Stop helping him!","Перестань помогать ему!", ""],
                ["Go on reading!","Продолжай чтение.", ""],
                ["Why does your father refuse to give up smoking?","Почему твой папа не хочет (отказывается) бросить курить?", ""],
                ["Please excuse my troubling you!","Извините, пожалуйста, что я беспокою вас!", ""],
                ["Do you mind my speaking so loud?","Вам не мешает, что я так громко разговариваю?", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Условные предложения.",
        ],
        [
            "type" => "content",
            "content" => "В английском языке существуют условные предложения реального условия, т. е. такие, действие 
                которых при определённых условиях может быть выполнено (совершено).",
        ],
        [
            "type" => "content",
            "content" => "Такие условные предложения имеют в английском языке два времени: настоящее и прошедшее.",
        ],
        [
            "type" => "content",
            "content" => "Будущее время в придаточных предложениях этих условных предложений не употребляется, а 
                заменяется настоящим (Present Indefinite).",
        ],
        [
            "type" => "example",
            "content" => [
                ["I shall work in the garden, if I come home early.","Я буду работать в саду, если я приду домой рано.", ""],
                ["I work in the garden, if I come home early.","Я работаю в саду, если я возвращаюсь домой рано.", ""],
                ["I worked in the garden, if I came home early.","Я работал в саду, если я возвращался домой рано.", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Суффиксы имен прилагательных.",
        ],
        [
            "type" => "content",
            "content" => "Наиболее распространённые суффиксы имён прилагательных «-ful» и «-less». «Ful» указывает на 
                наличие данного качества у прилагательного, а «less» на отсутствие.",
        ],
        [
            "type" => "example",
            "content" => [
                ["use / useful", "польза / полезный"],
                ["doubt / doubtful", "сомнение / сомнительный"],
                ["hope / hopeless", "надежда / безнадёжный"],
                ["help / helpless", "помощь / беспомощный"],
            ],
        ],
        [
            "type" => "header",
            "content" => "Глагол «do» в утвердительных предложениях.",
        ],
        [
            "type" => "content",
            "content" => "Иногда вспомогательный глагол «do» ставится в утвердительном предложении. В этих случаях он 
                обычно переводится как «пожалуйста», «ну же!»",
        ],
        [
            "type" => "example",
            "content" => [
                ["Do come to see us on Sunday!","Пожалуйста, приходите к нам (повидать нас) в воскресенье!", ""],
                ["Stop crying, do!","Перестань плакать, ну же!", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Слово «news» и глаголы.",
        ],
        [
            "type" => "content",
            "content" => "Слову «news» — «новости» всегда соответствует глагол в единственном числе.",
        ],
        [
            "type" => "example",
            "content" => [
                ["The news that he told us was very good.", "Новости, которые он рассказал нам, были очень интересными."],
            ],
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];


