<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Past Perfect Tense (прошедшее совершённое время).",
        ],
        [
            "type" => "content",
            "content" => "Past Perfect Tense (прошедшее совершённое время) употребляется для выражения действия, 
                совершённого к какому-то моменту в прошлом. Этот момент обычно выражается другим действием в прошлом, 
                например глаголом в Past Indefinite Tense (прошедшем неопределённом времени).",
        ],
        [
            "type" => "example",
            "content" => [
                ["Когда я пришёл в класс, я вспомнил, что оставил книгу дома.", "", "К тому моменту, когда человек вспомнил, предыдущее действие <i>оставил книгу дома</i> было уже закончено, значит, следует глагол <i>оставил</i> употребить в Past Perfect Tense - прошедшем совершённом времени."],
                ["Он сказал, что его брат ушёл на работу час тому назад.", "", "В то время как он говорил, брат был уже на работе, т. е. к моменту разговора он уже ушёл."],
            ],
        ],
        [
            "type" => "content",
            "content" => "Иногда момент, к которому действие уже завершилось, выражается обстоятельством времени.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Я прочитал эту книгу вчера к пяти часам вечера. Вчера к этому времени мы уже закончили работу в саду.", ""],
            ],
        ],
        [
            "type" => "content",
            "content" => "Past Perfect Tense (прошедшее совершённое время) образуется из вспомогательного глагола 
                «to have» в Past Indefinite Tense (прошедшем неопределённом времени) (had) + Past Participle (причастие 
                прошедшего времени) спрягаемого глагола.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I had finished my dinner when you came in.", "Я закончил обедать, когда вы вошли."],
                ["I had written the letter by nine o’clock yesterday.", "Я написал письмо к девяти часам вчера."],
                ["Не had learned English in England for four years before he came here.", "Он изучал английский язык в Англии в течение четырёх лет, прежде чем он приехал сюда."],
            ],
        ],
        [
            "type" => "header",
            "content" => "Правило последовательности времён в английском языке.",
        ],
        [
            "type" => "content",
            "content" => "В английском языке существует правило, которое называется правило последовательности времён. 
                Оно заключается в следующем: если сказуемое в главном предложении стоит в прошедшем времени, 
                то сказуемое придаточного дополнительного предложения тоже должно стоять в прошедшем времени.",
        ],
        [
            "type" => "example",
            "content" => [
                ["He said that he was ill.", "Он сказал, что он болен."],
            ],
        ],
        [
            "type" => "content",
            "content" => "Если в придаточном предложении по смыслу должно стоять будущее время, то употребляется особая 
                форма будущего времени: будущее в прошедшем (Future in the Past). Это время образуется из прошедшего 
                времени глаголов «shall» и «will» («should» и »would) + неопределённая форма глагола без частицы «to».",
        ],
        [
            "type" => "example",
            "content" => [
                ["He said he would come tomorrow.", "Он сказал, что он придёт завтра."],
                ["I asked him if he would see Polly.", "Я спросил его, увидит ли он Полю."],
                ["I told him I should return the book next week.", "Я сказал ему, что я верну книгу на следующей неделе."],
            ],
        ],
        [
            "type" => "header",
            "content" => "Значения глагола «would».",
        ],
        [
            "type" => "content",
            "content" => "Глагол «would» в английском языке может употребляться в нескольких значениях. В придаточных 
                дополнительных предложениях для обозначения будущего времени в связи с правилом о последовательности 
                времён.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Не said he would wait for me.", "Он сказал, что он подождёт меня.", "... он будет ждать меня."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«Would» иногда употребляется в 1-м лице единственного и множественного числа. В этих случаях 
                глагол «would» имеет модальное значение, т. е. приобретает оттенок намерения, желания или согласия.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I said that I would help him.", "Я сказал, что я помогу ему."],
                ["We promised that we would come in the evening.", "Мы обещали, что мы придём вечером."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«Would» употребляется со всеми лицами единственного и множественного числа в отрицательных 
                предложениях для выражения упорного нежелания совершить действие в прошлом.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I tried to speak to him, but he would not listen to me.", "Я пытался говорить с ним, но он упорно не желал слушать меня."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«Would» употребляется со всеми лицами единственного и множественного числа для выражения 
                повторного действия в прошлом (в значении бывало).",
        ],
        [
            "type" => "example",
            "content" => [
                ["He would sit for hours without speaking to anybody.", "Он, бывало, сидел часами, не разговаривая ни с кем."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«Would» часто употребляется при вежливом обращении. ",
        ],
        [
            "type" => "example",
            "content" => [
                ["Would you tell me the time, please.", "Нe будете ли вы добры сказать, который час."],
                ["Would you mind closing the window?", "He будете ли вы любезны закрыть окно."],
            ],
        ],
        [
            "type" => "header",
            "content" => "Сравнительная степень прилагательных.",
        ],
        [
            "type" => "content",
            "content" => "Некоторые прилагательные в английском языке имеют в сравнительной и превосходной степени две формы. Эти формы различаются по своему значению.",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["old - older, oldest / elder, eldest", "более старый, самый старый / старше, самый старший"],
                ["late - later, latest / latter, last", "более поздний, самый поздний / последний из двух, самый последний"],
                ["far - farther, farthest / father, furthest", "более далёкий, самый далёкий по расстоянию / дальнейший, самый дальний по времени"],
            ],
        ],
        [
            "type" => "example",
            "content" => [
                ["My sister is older than I.","Моя сестра старше (старее) меня.", ""],
                ["When does your elder sister come home?","Когда твоя старшая сестра приходит домой?", ""],
                ["My eldest sister is not in Moscow now.","Моей самой старшей сестры нет сейчас в Москве.", ""],
                ["Jimmy and Sam were sitting on the bench; the latter was reading a book.","Джимми и Сэм сидели на скамейке; последний читал книгу.", ""],
                ["Tell me the latest news.","Расскажите мне последние новости (т. е. последние из тех, которые вам известны).", ""],
                ["What is Pushkin’s last poem?","Какое последнее (т. е. самое последнее) стихотворение Пушкина?", ""],
                ["Не spoke so much about his further plans that I got tired.","Он так много говорил о своих дальнейших планах, что я устал.", ""],
                ["His house stands at the farthest end of the street.","Его дом стоит на самом дальнем конце улицы.", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Употребление артиклей с именами существительными.",
        ],
        [
            "type" => "content",
            "content" => "Неопределённый артикли «a» и «an» употребляется только перед исчисляемыми существительными в 
                единственном числе. Они употребляются в тех случаях, когда мы говорим о существительном впервые 
                (A man came into the room. Человек вошёл в комнату); когда мы называем какой-нибудь предмет из числа, 
                ему подобных (Give me a pen, please. Дай мне ручку, пожалуйста). Можно сказать, что неопределённые 
                артикли употребляется тогда, когда их можно в русском предложении заменить местоимением «какой-то», 
                «какой-нибудь».",
        ],
        [
            "type" => "content",
            "content" => "Определённый артикль «the» употребляется для выделения данного предмета из числа ему подобных. 
                Обычно в русском языке в таких случаях мы можем перед существительным поставить слова «этот», «тот», 
                «свой», «эти», «те», «свои».",
        ],
        [
            "type" => "example",
            "content" => [
                ["I see a big garden. I like the garden.", "Я вижу большой сад. Я люблю [этот] сад"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Определённый артикль обычно употребляется перед порядковыми числительными и прилагательными в 
                превосходной степени, за которыми следуют имена существительные.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Hе is the best man in the world.", "Он лучший человек на свете."],
                ["Lily wanted the biggest apple on the apple-tree.", "Лиля хотела самое большое яблоко с этой яблони."],
            ],
        ],
        [
            "type" => "content",
            "content" => "С обстоятельствами места (отвечают на вопросы: «где?» и «куда?») также в большинстве случаев 
                употребляется определённый артикль.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I often go to the theatre.", "Я часто хожу в театр."],
            ],
        ],
        [
            "type" => "content",
            "content" => "Имена собственные, как правило, употребляются без артикля. Но в некоторых случаях перед 
                именами собственными артикль ставится, так например: перед названиями океанов, морей, озёр, рек; перед 
                словами: «север», «запад», «юг», «восток»; перед фамилиями, если они заключают в себе представление о целой 
                семье (Петровы — the Petrovs; Ивановы — the Ivanovs); перед названиями газет и журналов.",
        ],
        [
            "type" => "header",
            "content" => "Союз «whether».",
        ],
        [
            "type" => "content",
            "content" => "Союз «whether» соединяет главное предложение с придаточным. Он соответствует в русском языке 
                частице «ли», но в то время как частица «ли» в русских предложениях стоит после глагола, союз whether 
                стоит в начале придаточного предложения.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I do not know whether he wants to see you.", "Я не знаю, хочет ли он видеть вас."],
                ["Ask him whether he can do this work tomorrow.", "Спросите его, сможет ли он сделать эту работу завтра."],
            ],
        ],
        [
            "type" => "header",
            "content" => "Союз «as».",
        ],
        [
            "type" => "content",
            "content" => "«As» имеет несколько значений.",
        ],
        [
            "type" => "content",
            "content" => "«as» — «как»:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["As you know, they live here.", "Как вы знаете, они живут здесь."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«as ... as» — «такой же ... как»:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["She is as clever as her brother.", "Она такая же умная, как её брат."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«not so ... as» — «не такой ... как»:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["Jimmy is not so good as you think.", "Джимми не такой хороший, как вы думаете."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«as» — «когда»:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["As she was coming home, she saw a crowd of people in front of her house.", "Когда она шла домой (была идущей домой), она увидела толпу людей перед своим домом."],
            ],
        ],
        [
            "type" => "content",
            "content" => "«as if» — «как будто»:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["Lily looked at us as if she were angry with us.", "Лиля смотрела на нас [так], как будто она сердится на нас."],
            ],
        ],
        [
            "type" => "content",
            "content" => "<u>Примечание</u>. Если в придаточном предложении, которое начинается с «as if», сказуемое 
                выражено глаголом «to be» или содержит глагол «to be», то этот глагол всегда будет иметь форму «were».",
        ],
        [
            "type" => "example",
            "content" => [
                ["Hе speaks about food as if he were always hungry.", "Он говорит о еде, как будто он [был] всегда голоден."],
            ],
        ],
        [
            "type" => "header",
            "content" => "Придаточные предложения.",
        ],
        [
            "type" => "content",
            "content" => "В придаточных предложениях условия и времени Future Indefinite Tense (будущее неопределённое 
                время) не употребляется, а заменяется Present Indefinite Tense (настоящим неопределённым временем).",
        ],
        [
            "type" => "example",
            "content" => [
                ["We shall see you at five if you come to the Dales.", "Мы увидим вас в пять, если вы приедете к Дэйлам."],
                ["When he comes, ask him to ring me up.", "Когда он придёт, попроси его позвонить мне по телефону."],
            ],
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];

