<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Настоящее неопределённое время (Present Indefinite Tense) отрицательная и вопросительная форма 
                предложений.",
        ],
        [
            "type" => "content",
            "content" => "<b>Напоминание</b>: Present Indefinite Tense употребляется для обозначения действия, которое 
                происходит обычно или постоянно в настоящем времени.",
        ],
        [
            "type" => "content",
            "content" => "Вопросительная и отрицательная формы настоящего неопределённого времени образуются из 
                вспомогательного глагола «to do» («does» — в 3-м лице ед. числа для «she», «he», «it») и смыслового 
                глагола в неопределённой форме без частицы «to».",
        ],
        [
            "type" => "content",
            "content" => "Вспомогательный глагол на русский язык не переводится.",
        ],
        [
            "type" => "content",
            "content" => "При вопросах вспомогательный глагол ставится перед подлежащим. Остальные члены предложения 
                остаются без изменения.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Do you read English?", "Вы читаете по английски?"],
                ["Does he want to play with us?", "Он хочет играть с нами?"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Отрицательная форма настоящего неопределённого времени образуется из вспомогательного глагола 
                «do» («does») и отрицания «not», которое ставится после вспомогательного глагола.",
        ],
        [
            "type" => "content",
            "content" => "С глаголом «do» приняты следующие сокращения: «do not» = «don't» и «does not» = «doesn’t».",
        ],
        [
            "type" => "example",
            "content" => [
                ["I do not (don't) read English well.", "Я не читаю по английски хорошо", "Я плохо читаю по английски"],
                ["He does not (doesn’t) want to go to the lake.", "Он не хочет идти на озеро?"],
            ],
        ],
        [
            "type" => "content",
            "content" => "На вопросы, которые начинаются со вспомогательного глагола, можно давать как полные, так и 
                        краткие ответы. Краткие ответы «да» или «нет» строятся следующим образом:",
        ],
        [
            "type" => "content",
            "content" => "
                    а) утверждение «yes» или отрицание «nо»;<br>
                    б) подлежащее, выраженное соответствующим личным местоимением;<br>
                    в) тот глагол, который был в вопросе в начале предложения. Если ответ отрицательный, то добавляется 
                       отрицание «not».",
        ],
        [
            "type" => "example",
            "content" => [
                ["Do you like to read books?", "Yes, I do. Или: No, I do not.", "Вы любите читать книги? Да. Нет"],
                ["Does Jim swim well?", "Yes, he does. Или: No, he does not.", "Джим плавает хорошо. Да. Нет"],
            ],
        ],
        [
            "type" => "header",
            "content" => "Глагол «to do».",
        ],
        [
            "type" => "content",
            "content" => "Глагол «to do» также имеет и самостоятельное значение — «делать».",
        ],
        [
            "type" => "example",
            "content" => [
                ["They <b class='color'>do</b> their lessons after school.", "Они <b class='color'>делают</b> [свои] уроки после школы."],
                ["What <b class='color'>do</b> you do in the evening?", "Что вы <b class='color'>делаете</b> вечером?"],
            ],
        ],
        [
            "type" => "header",
            "content" => "Слово «often».",
        ],
        [
            "type" => "content",
            "content" => "Слово «often» (часто) ставится перед глаголом, а сочетание слов «very often» (очень часто) — в конце предложения.",
        ],
        [
            "type" => "example",
            "content" => [
                ["We often play football.", "Мы часто играем в футбол."],
                ["They play volley-ball very often.", "Они играют в волейбол очень часто."],
            ],
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];
