<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Годы в английском языке.",
        ],
        [
            "type" => "content",
            "content" => "По-русски говорят: «в 1963 году» («в тысяча девятьсот шестьдесят третьем»), по-английски 
                говорят: «19/63» («nineteen sixty-three»),т. е. делят дату пополам; «девятнадцать» (сотен) — «шестьдесят 
                три», а слово «год» опускается.",
        ],
        [
            "type" => "header",
            "content" => "Степени сравнения прилагательных.",
        ],
        [
            "type" => "content",
            "content" => "Степени сравнения односложных и некоторых двусложных прилагательных образуются путём 
                добавления суффиксов «-er» (в сравнительной степени) и «-est» (в превосходной степени) к основе.",
        ],
        [
            "type" => "example",
            "content" => [
                ["warm / warmer / the warmest", "тёплый / теплее / самый тёплый"],
                ["dark / darker / the darkest", "тёмный / темнее / самый тёмный"],
                ["deep / deeper / the deepest", "глубокий / глубже / самый глубокий"],
                ["small / smaller / the smallest", "маленький / меньше / самый маленький",],
                ["big / bigger / the biggest", "большой / больше / самый большой",],
                ["thin / thinner / the thinnest", "тонкий / тоньше / самый тонкий",],
                ["hot / hotter / the hottest", "горячий / горячее / самый горячий",],
                ["early / earlier / the earliest", "ранний / раньше / самый ранний",],
                ["clever / cleverer / the cleverest", "умный / умнее / самый умный",],
            ],
        ],
        [
            "type" => "content",
            "content" => "Перед многосложными прилагательными в сравнительной степени ставится «more» и в превосходной 
                степени «the most».",
        ],
        [
            "type" => "example",
            "content" => [
                ["difficult / more difficult / the most difficult", "трудный / труднее / самый трудный"],
                ["interesting / more interesting / the most interesting", "интересный / более интересный / самый интересный"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Особо образуют степени сравнения следующие прилагательные:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["good / better / the best", "хороший / лучше / самый лучший"],
                ["bad / worse / the worst", "плохой / хуже / самый плохой"],
                ["little / less / the least [least]", "маленький / меньше / самый маленький [меньше всего]"],
                ["many (much) / more / the most [most]", "много / больше / самый большой [больше всего]"],
            ],
        ],
        [
            "type" => "header",
            "content" => "Отрицания в английских предложениях.",
        ],
        [
            "type" => "content",
            "content" => "В русском языке в предложении может быть несколько отрицаний.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Я никогда не ем мяса.", "1-е отрицание: «никогда»; 2-е отрицание: «не ем»", ""],
            ],
        ],
        [
            "type" => "content",
            "content" => "В английском предложении не может быть больше одного отрицания.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I never eat meat.", "Я никогда не ем мяса.", ""],
                ["I eat no meat.", "Я не ем мяса.", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Артикль «the» перед фамилиями.",
        ],
        [
            "type" => "content",
            "content" => "Перед фамилией ставится определённый артикль «the» в том случае, когда говорится о всех членах 
                этой семьи; фамилия при этом стоит во множественном числе.",
        ],
        [
            "type" => "example",
            "content" => [
                ["the Dales, the Woodlands, the Christines", "", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Артикли перед обращениями.",
        ],
        [
            "type" => "content",
            "content" => "При обращении перед существительными артикль не ставится. Обращение — это слово или 
            словосочетание, обозначающее лицо или предмет, к которому обращена речь («Миша, сделай...». Слово «Миша» - 
            обращение).",
        ],
        [
            "type" => "example",
            "content" => [
                ["Children, let us go to the river!", "Дети (обращение), пойдёмте к реке!", ""],
                ["Girls, where is your teacher?", "Девочки (обращение), где ваша учительница?", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "«Me» вместо «I».",
        ],
        [
            "type" => "content",
            "content" => "Иногда в разговорной речи вместо «I» — «я» говорят «me».",
        ],
        [
            "type" => "example",
            "content" => [
                ["Who is there! It’s me.", " Кто там?  Это я.", ""],
            ],
        ]
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];



