<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Дополнения в английских предложениях.",
        ],
        [
            "type" => "content",
            "content" => "В английском языке дополнения бывают прямые, косвенные и предложные. Прямое дополнение 
                    отвечает на вопросы: «кого?» «что?».",
        ],
        [
            "type" => "example",
            "content" => [
                ["I see a flower.", "Я вижу цветок.", "«a flower» — прямое дополнение"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Косвенное дополнение отвечает на вопросы: «кому?» «чему?»",
        ],
        [
            "type" => "example",
            "content" => [
                ["Give	him	the	book.", "Дай ему эту книгу.", "«him» — косвенное дополнение"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Перед предложными дополнениями всегда стоит предлог.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I want to play with him.", "Я хочу играть с ним.", "«with him» — предложное дополнение"],
            ],
        ],
        [
            "type" => "content",
            "content" => "В английском предложении после сказуемого стоит косвенное дополнение, затем прямое и далее 
                предложное.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Mother (подлежащие) gives (сказуемое) (дополнения:) him (косвенное)  an apple (прямое) for Polly (предложное).", "Мама дает ему яблоко для Поли.", ""],
                ["Mother (подлежащие) gives (сказуемое) (дополнения:) Sam (косвенное)  a book (прямое) for Polly (предложное).", "Мама дает Сэму книгу для Поли.", ""],
            ],
        ],
        [
            "type" => "content",
            "content" => "Местоимение «it» всегда ставится перед косвенным дополнением.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Here is a red apple. Give it to Jim.", "Вот красное яблока. Дай его Джиму.", ""],
            ],
        ],
        [
            "type" => "header",
            "content" => "Слово «hair».",
        ],
        [
            "type" => "content",
            "content" => "Слово «hair» — «волосы» употребляется всегда в единственном числе.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Her hair is black.", "Её волосы чёрные"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Выражение «a hair» означает «волосок».",
        ],
        [
            "type" => "header",
            "content" => "Вопрос «What time is it?»",
        ],
        [
            "type" => "content",
            "content" => "На вопрос «What time is it?» отвечают «It is two o’clock.» ([Сейчас] два часа.) или «It is two 
                (o’clock) sharp.» ([Сейчас] два (часа) ровно.)",
        ],
        [
            "type" => "content",
            "content" => "Когда говорят о часах с минутами, в английском языке обычно употребляют два предлога: «past» 
                и «to».",
        ],
        [
            "type" => "content",
            "content" => "Если минутная стрелка находится в правой половине циферблата (от 12 до 6), употребляют «past».",
        ],
        [
            "type" => "example",
            "content" => [
                ["It is five minutes past twelve.", "(Сейчас) пять минут первого.", "[Сейчас] пять минут после двенадцати"],
                ["It is fifteen minutes past six.", "(Сейчас) пятнадцать минут седьмого.", "[Сейчас] пятнадцать минут после шести"],
                ["It is a quarter past six.", "(Сейчас) четверть седьмого.", "[Сейчас] четверть после шести"],
                ["It is half past three.", "(Сейчас) половина четвёртого.", "[Сейчас] половина после трёх"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Когда минутная стрелка находится в левой половине циферблата (от 6 до 12), употребляют «to».",
        ],
        [
            "type" => "example",
            "content" => [
                ["It is five minutes to seven.", "(Сейчас) без пяти минут семь.", "[Сейчас] пять минут до семи"],
                ["It is a quarter to seven..", "(Сейчас) без четверти семь.", "[Сейчас] пятнадцать минут до семи"],
            ],
        ],

        [
            "type" => "content",
            "content" => "Обратите внимание: «a quarter» — с артиклем, «half» — без артикля.",
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];


