<?php
$header = "Валентина Скультэ. Английский для детей. Том 2.";

$this->title = 'Второй том учебника: Английский язык для детей Валентины Скультэ.';
$this->params['keywords'] = 'английский язык, обучение, бесплатно, Валенина Скультэ, английский для детей, второй том';
$this->params['description'] = 'Второй том учебника: Английский язык для детей Валентины Скультэ. Второй том подойдет 
    людям уже немного знакомым с английским языком, которые хотят улучшить свои знания. Второй том научит понимать 
    устную английскую речь, разговаривать с правильным произношением и уверенно читать английские тексты.';

$description = "
<p>Второй том курса Валентины Скультэ Английский для детей рассчитан на людей уже немного знакомых с 
английским языком. Если Вы только начинаете знакомиться с языком и первый урок второго тома у Вас вызовет 
затруднения, начните занятия с первого тома. <a href='valentina_skulte_anglijskij_dlya_detej_tom_1'>Первый&nbsp;том&nbsp;тут&nbsp;»»»</a></p>
";


