<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "header",
            "content" => "Как учить английский язык?",
        ],
        [
            "type" => "content",
            "content" => "Первый вопрос: «учить с преподавателем или самостоятельно?» Для ответа на этот вопрос 
                посмотрим из чего состоит обучение. А обучение состоит из самых простых шагов: ",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["", "1. Узнать новые слова."],
                ["", "2. Узнать, как эти слова превращаются в предложения."],
                ["", "3. Научиться понимать эти предложения на слух."],
                ["", "4. Научиться читать."],
                ["", "5. Научиться говорить."],
                ["", "6. И научиться писать (если это нужно)."],
            ],
        ],
        [
            "type" => "content",
            "content" => "При нынешнем развитии компьютерной техники преподаватель ни на одном из этих этапов не нужен. 
                Всему этому Вы можете обучиться прямо на сайте. Т.е. не нужно тратить деньги на то, что у Вас и так 
                есть. А что у Вас есть спросите Вы? А есть у Вас следующее: ",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["", "1. Программа по заучиванию новых слов. Она позволяет за час запоминать до 60-ти новых слов."],
                ["", "2. Объяснение как эти слова превращаются в предложения."],
                ["", "3. Английские тексты, озвученные профессиональными дикторами, а также специальная программа 
                            которая научит и читать, и воспринимать английскую речь на слух."],
                ["", "4. Программа, которая научит Вас говорить на английском языке."],
            ],
        ],
        [
            "type" => "content",
            "content" => "Т.е. сайт будет делать всё что делает преподаватель английского, только:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["", "1. Бесплатно."],
                ["", "2. Тогда, когда Вы захотите."],
                ["", "3. И где Вы захотите"],
            ],
        ],
        [
            "type" => "content",
            "content" => "А от Вас нужно только одно: желание заниматься. При этом курс построен так, что заниматься Вы 
                можете где угодно: по дороге на работу или с работы, в обеденный перерыв, на прогулке, на пробежке или 
                сидя дома за компьютером. Нужно только начать.",
        ],
        [
            "type" => "content",
            "content" => "<b>И да, успех мы гарантируем!</b>",
        ],
    ],
];
