<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "header",
            "content" => "Как будут построены уроки.",
        ],
        [
            "type" => "content",
            "content" => "В этом уроке будет подробно описано как пользоваться сайтом. Текста много, но он нужен.",
        ],

        [
            "type" => "subtitle",
            "content" => "Все уроки будут состоять из 4-х частей:",
        ],
        [
            "type" => "exampleNN",
            "content" => [
                ["", "1. Новые слова."],
                ["", "2. Объяснения к уроку"],
                ["", "3. Тренировка чтения и понимания английской речи."],
                ["", "4. Разговорная практика."],
            ],
        ],
        [
            "type" => "content",
            "content" => "Первые уроки будут очень короткими и простыми. Если у Вас будет желание и настроение их можно 
                брать сразу по 2-3 в день.",
        ],
    ],
];

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "header",
            "content" => "Программа для быстрого запоминания английских слов",
        ],
        [
            "type" => "content",
            "content" => "Для изучения новых английских слов на сайте есть специальная программа. Эта программа 
                разбивает список новых слов на блоки по 3 слова. И предлагает Вам запомнить каждый блок по отдельности. 
                Это очень облегчает и ускоряет запоминание. Как работает программа можно 
                <b><a target='_blank' href='/study/help_word_player'>прочитать&nbsp;тут&nbsp;»»»</a></b>",
        ],
    ],
];

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "header",
            "content" => "Как правильно учить слова.",
        ],
        [
            "type" => "content",
            "content" => "Сайт будет произносить английское слово и перевод, а также писать эти слова на экране. 
                Вам нужно делать две вещи: повторять за диктором английское слово и смотреть как оно 
                пишется. Так Вы научитесь правильно произносить слово, запомните как оно пишется и сможете переводить 
                его когда услышите или встретите в тексте.",
        ],
    ],
];

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Артикли в английском языке.",
        ],
        [
            "type" => "content",
            "content" => "Артикль — это короткое слово, которое позволяет понять говорим мы о конкретном предмете
                или о предметах вообще. Например, если мы говорим о кошках вообще, а не о какой-то конкретной кошке, то
                употребляется неопределенный артикль «<b>a</b>» и выглядит это так: «<b>a</b> cat». А если о конкретной кошке, 
                например живущей у соседа, то употребляется артикль «<b>the</b>» и выглядит это так: «<b>the</b> cat». Если перед 
                словом стоит количество предметов, то артикль «a» не ставится: «one cat» - «одна кошка»."
        ],
    ],
];

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "header",
            "content" => "Тренировка чтения и понимания английской речи на слух.",
        ],
        [
            "type" => "content",
            "content" => "Тренировка чтения и понимание устной речи на английском языке осуществляется при помощи 
                лингафонных (аудированных) уроков. Лингафонный урок — это английский текст, разбитый на отдельные 
                предложения и озвученный профессиональными дикторами. Речь диктора сопровождается текстом на английском и 
                русском языках. Таким образом, Вы сможете одновременно и слушать, и читать английский текст. Это научит 
                Вас понимать устную и письменную речь, а также поможет выработать правильное английское произношение. 
                Скорость воспроизведения текста в уроках снижена до 60% от нормальной скорости речи. Если Вам это 
                покажется слишком медленным, просто увеличьте скорость воспроизведения. О том, как пользоваться 
                проигрывателем аудио уроков можно
                <b><a target='_blank' href='/lingofon/help_lingofon_lesson_player'>прочитать&nbsp;тут&nbsp;»»»</a></b>"
        ],
        [
            "type" => "subtitle",
            "content" => "Работа с аудио уроком состоит из 5-ти шагов:",
        ],
        [
            "type" => "content",
            "content" => "<b>1.</b> Прослушивание предложения на английском языке. В ходе прослушивания Вы стараетесь 
                           услышать и отделить все услышанные слова друг от друга. На этом этапе смысл и перевод 
                           услышанного Вам понимать не обязательно. Нужно только различить максимально большое 
                           количество слов в предложении. Научить ухо слышать английскую речь. Слушать предложение нужно 
                           до тех пор, пока Вы не различите все слова в предложении или пока новые прослушивания не
                           перестанут улучшать Ваше восприятие.",
        ],
        [
            "type" => "content",
            "content" => "<b>2.</b> Продолжая слушать английский текст Вы смотрите на напечатанную версию того что в данный момент
                            слушаете (распечатки всех лингафонных курсов на сайте есть и доступны на странице урока). 
                            Рассматривая текст Вы увидите правильно ли Вы на слух различили слова в предложении. 
                            На этом этапе Вы научитесь правильно читать английские слова и воспринимать на слух 
                            непривычные звуки английской речи. Продолжайте слушать предложение пока не начнете четко
                            слышать все слова, произносимые в предложении.",
        ],
        [
            "type" => "content",
            "content" => "<b>3.</b> На этом этапе Вы открываете перевод английского текста (все переводы есть на сайте 
                            и доступны на странице урока) и внимательно смотрите как переводится текст. С открытым 
                            переводом прослушиваете текст несколько раз так, чтобы английский текст и перевод на русский 
                            язык у вас твердо связались.",
        ],
        [
            "type" => "content",
            "content" => "<b>4.</b> Наконец произношение. После того как перевод английского текста Вам стал понятен Вы 
                            убираете с экрана русский текст и оставляйте только английский. Одновременно слушая и 
                            прослеживая текст глазами начинайте про себя, в голове, не шевеля губами проговаривать текст 
                            вслед за диктором. Как только это вам удастся, начинайте проговаривать этот текст тихим 
                            шепотом двигая губами. Как только это Вам удастся, начинайте проговаривать текст вслух. 
                            Чем громче Вы это сделаете, тем лучше. Проговаривая старайтесь чтобы Ваша интонация и 
                            произношение были максимально похожи на речь английского диктора.",
        ],
        [
            "type" => "content",
            "content" => "<b>Замечание:</b>
                            Описанное далее можно отложить до момента когда Вы почувствуете что уже начали понимать 
                            английский.",
        ],
        [
            "type" => "content",
            "content" => "<b>5.</b> 
                            Проговаривая текст за диктором желательно добиться скорости произношения как у диктора. 
                            Как только это у Вас получится, выключите воспроизведение и начните читать текст вслух. 
                            Прочтите текст 3 - 4 раза. Включите воспроизведение и проверьте Ваше произношение. И наконец, 
                            последнее, выключите звук, уберите с экрана текст и попробуйте самостоятельно, осмысленно, 
                            понимая перевод произносить английскую фразу. Осознавая, что Вы говорите. Закончите это 
                            упражнение, как только начнете говорить фразу без затруднений и запинки. Итак, переходя от 
                            предложения к предложению пройдите весь урок. Как только Вы изучите все предложения по 
                            отдельности, включите воспроизведение урока целиком, а не по 1 предложению. Как только Вы 
                            начнете понимать урок в такой форме, можно переходить к следующему уроку.",
        ],
        [
            "type" => "content",
            "content" => "Звучит немного страшно, но на самом деле всё очень просто.",
        ],
        [
            "type" => "content",
            "content" => "<b>Замечание</b>: не следует пренебрегать пунктом 4. Проще сразу сформировать правильное 
                            произношение чем потом исправлять неверное. Это точно без преподавателя сделать не 
                            получится.",
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
];

$lessonParts[] = [
    "type" => "speaking",
];

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "content",
            "content" => "<b>Замечание</b>: Речевую практику можно отложить до момента когда Вы начнете уверенно понимать 
                английскую речь в лингафонных уроках. Не нужно себя перегружать.",
        ],

    ],
];

$lessonParts[] = [
    "type" => "paragraph",
    "content" => [
        [
            "type" => "content",
            "content" => "О том как пользоваться страницей разговорной практики можно 
                <b><a target='_blank' href='/lingofon/help_speaking_player'>прочитать&nbsp;тут&nbsp;»»»</a></b>",
        ],
    ],
];



