<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Слово «down» в английском языке",
        ],
        [
            "type" => "content",
            "content" => "Слово «down» означает движение вниз и часто на русский язык не переводится.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Sit down.", "Сядь!", ""],
                ["Put down.", "Положи", ""],
            ],
        ],

        [
            "type" => "header",
            "content" => "Буква «k» перед «n»",
        ],
        [
            "type" => "content",
            "content" => "В английском языке буква «k» перед «n» не читается.",
        ],
        [
            "type" => "example",
            "content" => [
                ["knife", "нож", ""],
            ],
        ],

        [
            "type" => "header",
            "content" => "Множественное число слов с окончанием «-f» или «-fe».",
        ],
        [
            "type" => "content",
            "content" => "Многие слова, оканчивающиеся на «-f» или «-fe» в единственном числе, во множественном числе меняют окончание «-f» или «-fe» на «-ves».",
        ],
        [
            "type" => "example",
            "content" => [
                ["wol<b>f</b> (волк)", "wol<b>ves</b> (волки)", ""],
                ["kni<b>fe</b> (нож)", "kni<b>ves</b> (ножи)", ""],
            ],
        ],

        [
            "type" => "header",
            "content" => "Глаголы с предлогами наречиями или фразовые глаголы.",
        ],
        [
            "type" => "content",
            "content" => "В английском языке имеется много глаголов с предлогами-наречиями.",
        ],
        [
            "type" => "example",
            "content" => [
                ["to put on", "надевать", ""],
                ["to sit down", "садиться", ""],
            ],
        ],
        [
            "type" => "content",
            "content" => "В повелительном предложении предлог-наречие может стоять как после глагола, так и в конце предложения.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Put your shoes on!", "Надень ботинки!", "Надень твои (свои) ботинки!"],
                ["Put on your shoes!", "Надень ботинки!", "Надень твои (свои) ботинки!"],
            ],
        ],
        [
            "type" => "content",
            "content" => "Но если вместо прямого дополнения «ботинки» стоит местоимение (в примере ниже «them» - «их»), то глагол с предлогом-наречием разделяется этим местоимением обязательно.",
        ],
        [
            "type" => "example",
            "content" => [
                ["Put them on!", "Надень их!", ""],
            ],
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 2,
];

$lessonParts[] = [
    "type" => "speaking",
];


