<?php
/** @var $lessonParams - массив параметров урока. Получен из контроллера */

$lessonParts[] = [
    "type" => "WordsToStudy",
];

$lessonParts[] = [
    "type" => "theory",
    "content" => [
        [
            "type" => "header",
            "content" => "Притяжательные местоимения.",
        ],
        [
            "type" => "content",
            "content" => "В английском языке притяжательные местоимения имеют I и II формы. Притяжательные местоимения I формы определяют имена существительные и отвечают на вопросы «чей», «чья», «чьё», «чьи»? Притяжательные местоимения II формы заменяют в предложении имена существительные.",
        ],
        [
            "type" => "example",
            "content" => [
                ["My book is on the table.", "Моя книга на столе.", "I форма. Местоимение «my» определяет чья книга."],
                ["This is my book and that is yours.", "Это моя книга, а та твоя [книга]", "II форма. Местоимение «yours» заменяет слово «книга»."],
            ],
        ],
        [
            "type" => "content",
            "content" => "Все притяжательные местоимения II формы (кроме mine) имеют окончание -s.",
        ],
        [
            "type" => "example",
            "content" => [
                ["I форма", "II форма", ""],
                ["my: мой, моя, моё, мои", "mine", ""],
                ["your: твой, твоя, твоё, твои", "yours", ""],
                ["his:  его", "his", ""],
                ["her: её", "hers", ""],
                ["its: его, её, их", "its", ""],
                ["our: наша, наш, наше, наши", "ours", ""],
                ["your: ваш, ваша, ваше, ваши", "yours", ""],
                ["their: их", "theirs", ""],
            ],
        ],
    ],
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 1,
];

$lessonParts[] = [
    "type" => "lingofon",
    "num" => 2,
];

$lessonParts[] = [
    "type" => "speaking",
];