<?php
$this->title = 'Первый том учебника: Английский язык для детей Валентины Скультэ.';
$this->params['keywords'] = 'английский язык, обучение, бесплатно, Валенина Скультэ, английский для детей, первый том';
$this->params['description'] = 'Первый том учебника: Английский язык для детей Валетины Скультэ. Учебник рассчитан на 
    людей, совсем не знакомых с английским языком или на людей, которые пробовали учить язык, но не получилось.';

$header = "Валентина Скультэ. Английский для детей. Том 1.";

$description = "
<p><b>Вы научитесь</b>: понимать английскую речь, читать и переводить тексты на английском языке, говорить с правильным
            произношением.</p>
            <p>Курс поможет Вам пройти путь от полного не знания английского языка до уровня уверенного пользования языком.</p>
            <p>Изначально курс был рассчитан на детей, но как показала практика, взрослым курс Валентины Скультэ подходит так же
                хорошо, как и детям.</p>
            <p>Начав заниматься английским языком по учебнику Скультэ Вы бысто начнете понимать речь на английском языке и что
                особенно
                важно, <b>Вы почувствуете уверенность в том что можете освоить английский язык</b>.
                Ощутимый результат будет уже через неделю.</p>
            <p>Курс дополнен аудированием (озвучиванием) уроков. Поэтому Вы сможете не только научится читать, но и научитесь
                понимать английскую речь на слух, а также говорить по-английски с правильным произношением.</p>
            <p>Каждый урок снабжен подробной инструкцией и пояснениями как этот урок проходить.</p>
";

