<style>
    p
    {
        font-size: 20px;
    }
</style>
<h1>Изучение английских слов</h1>
<br>
<p>На сайте размещена система для быстрого запоминания английских слов. Быстрое запоминание слов обеспечивается тем, что английские слова и варианты перевода произносятся (аудируются, озвучиваются) сайтом и одновременно печатаются на экране. Таким образом Вы запоминаете написание, произношение, перевод и правила чтения английского слова.</p>
<p>Как все устроено?</p>
<p>На сайте Вы можете создать собственную коллекцию английских слов, которые хотите запомнить или <a href="/learning_english_words">воспользоваться готовыми коллекциями английских слов</a>, размещенными на сайте.</p>
<p>Для более быстрого запоминания все коллекции английских слов разбиты на группы по 3 слова (размер группы Вы можете выбрать сами). Сайт по кругу повторят все слова из группы до тех пор, пока Вы не захотите перейти к следующей группе слов из коллекции. Небольшой размер группы, написание слова на экране, одновременное озвучивание английского слова и перевода помогут Вам быстро выучить английские слова.</p>
<p>Система изучения английских слов хороша и удобна тем, что слова можно учить по дороге на работу или с работы, во время прогулки, езде на велосипеде или во время поездки на автомобиле. В любое время и в любом месте где у Вас есть мобильный телефон или компьютер.</p>
<p>И самое главное: наша система изучения английских слов совершенна бесплатна. Т.е. даром :)</p>

<p><a href="/learning_english_words">Коллекции английских слов для изучения&nbsp;>>></a></p>
