<?php
$this->title = "Описание программы быстрого изучения английских слов. Вы сможете выучить 60 новых слов за час.";
$this->params['keywords'] = "английский язык, обучение, бесплатно, слова, словарный запас, быстрое заучивание английских слов";
$this->params['description'] = "Описание программы быстрого повышения словарного запаса английских слов. Метод основан на задействовании всех органов чувств доступных человеку. Используя данную программу Вы сможете выучить 60 новых слов за час.";
?>
<style>
    p {
        font-size: 20px;
    }
</style>
<h1>Учим английские слова</h1>
<h2>Страница помощи</h2>
<br>
<p>Так выглядит страница с программой изучения слов:</p>
<img src="/img/word_player.jpg" style="display: block; border-radius: 5px; border: 3px dashed lightgray; padding: 5px">
<br>
<p>Что бы начать обучение нужно нажать на кнопку "<b>Начать</b>"</p>
<p>На месте этой кнопки будут появляться английские слова и перевод. Также английские слова и перевод будут
    озвучиваться.</p>
<p>Если Вы захотите приостановить воспроизведение слов, просто нажмите на слово и воспроизведение остановится. Что бы
    возобновить проигрывание слов, снова нажмите на слово.</p>
<p>Слова воспроизводятся группами по 3 слова. Чтобы перейти к следующей группе слов воспользуйтесь кнопкой "<b>Далее&nbsp;>>></b>",
    а для возврата к предыдущей группе кнопкой "<b><<<</b>" слева от кнопки "<b>Далее&nbsp;>>></b>".</p>
<p>Если Вы хотите убрать какое-то слово из списка воспроизведения, нажмите на кнопку "<b>Исключить</b>", если хотите
    прослушать предыдущее слово нажмите на кнопку "<b><<<</b>" слева от кнопки "<b>Исключить</b>".</p>
<p>Кнопка "<b>В коллекцию 'Повторение'</b>" доступна только после регистрации на сайте. Эта кнопка нужна для добавления
    слова в новую коллекцию для последующего повторения. После нажатия на эту кнопку в списке Ваших коллекций слов
    появится новая коллекция, в которую будут занесены все слова, при проигрывании которых Вы нажмете кнопку "<b>В
        коллекцию 'Повторение'</b>"</p>
<p>Если Вы захотите проверить насколько хорошо Вы запомнили слова, то воспользуйтесь кнопкой "<b>Перемешать слова</b>".
    Программа перетасует все слова и начнет их проигрывать в новом порядке.</p>
<p>В поле "<b>Слов в группе</b>" - указано сколько слов будет включено в группу. Практика показала, что 3 слова в группе
    - это оптимальная цифра для быстрого и надежного запоминания. Если Вы захотите поэкспериментировать и выбрать своё
    волшебное число, просто измените цифру в поле и при переходе к следующей группе при помощи кнопки
    "<b>Далее&nbsp;>>></b>" в группе будет столько слов сколько Вы указали в этом поле.</p>
<p></p>
