<?php
$this->title = 'Английский язык - бесплатное обучение с нуля и до уверенного владения английским языком.';
$this->params['keywords'] = 'английский язык, обучение, бесплатно, Валенина Скультэ, английский для детей, метод Умина, метод Замяткина, программа изучения английских слов';
$this->params['description'] = 'На сайте размещены он-лайн курсы английского языка. Курс Валетины Скультэ Английский язык для детей. Изучение английского языка по методу Умина и Замяткина. Программа изучения английских слов.';
?>
<h1>Бесплатное изучение английского языка с нуля и до уверенного владения английским языком.</h1>
<style>
    .flex-container {
        display: flex;
        flex-flow: wrap;
        align-content: flex-start;
        padding: 10px
    }

    /* Decorations
    -------------------- */
    .flex-item {
        width: 400px;
        margin: 10px;
        padding: 5px;
        border-radius: 5px;
        border: 1px solid #000;
    }

    p {
        margin: 5px;
        font-size: 20px;
    }

    h2 {
        font-size: 20pt;
    }
</style>
<div class="flex-container">
    <div class="flex-item">
        <h2><a href="/skulte_anglijskij_dlya_detej" title="Валентина Скультэ Английский язык для детей.">Курс английского языка по учебнику Валентины Скульте.</a></h2>
        <p><b>Для тех кто только начинает или для тех кто пробовал, но не получилось.</b></p>
        <p>Курс на основе учебника английского языка Валентины Скультэ. Курс научит Вас понимать английский язык на слух,
            переводить английские тексты и говорить по-английски с правильным произношением. Интернет курс построен по
            материалам и методическим рекомендациям Валентины Скультэ советского преподавателя английского языка.
            Методика проверена многими поколениями детей, выросших и учившихся в России. Курс идеально подходит не
            только детям, но и взрослым, решившим учить язык.</p>
        <p><a href="/skulte_anglijskij_dlya_detej" title="Валентина Скультэ Английский язык для детей.">Перейти&nbsp;к&nbsp;обучению&nbsp;>>></a></p>
    </div>
    <div class="flex-item">
        <h2><a href="/lingofon" title="Лингафонный курс по методу Умина / Замяткина">Изучение английского языка по методу Умина / Замяткина.</a></h2>
        <p>Ускоренный метод изучения английского языка на основе лингафонных (аудированных) уроков. Курс обеспечивает
            быстрое приобретение навыков понимания, разговора и чтения на английском языке. Курс рассчитан на людей
            которые знают язык на начальном уровне. Если Вы сомневаетесь в своих знаниях,
            <a href="/skulte_anglijskij_dlya_detej" title="Валентина Скультэ Английский язык для детей.">начните с курса Валентины Скультэ</a>.</p>
        <br><br>
        <p><a href="/lingofon/metod_umin_zamyatkin" title="Описание лингафонного курса по методу Умина / Замяткина">Описание метода Умина / Замяткина</p>
        <p><a href="/lingofon" title="Лингафонный курс по методу Умина / Замяткина">Лингафонный курс</a></p>
    </div>
    <div class="flex-item">
        <h2>Учим английские слова</h2>
        <p>Методика позволяет в течение часа запоминать до 100 новых английских слов.</p>
        <p><a href="/learning_english_words/description">Описание методики</a></p>
        <p><a href="/learning_english_words">Перейти к изучению</a></p>
    </div>
</div>